In [1]:
import pandas as pd
import numpy as np

In [2]:
#değişken ismi = numpy.rastgele sayı.tam sayı(rastgele oluşacak sayı kaça kadar olsun,kaç tane veri olsun)
a = np.random.randint(10,size=6)
b = np.random.randint(10,size=6)
c = np.random.randint(10,size=6)
d = np.random.randint(10,size=6)

#değişken ismi= pandas.veri çerçevesi({"sütun adı":veri(bir önceki satırda oluşturduğum veriyi çağırıyorum)})
data = pd.DataFrame({"s1":a,"s2":b,"s3":c,"s4":d})

In [3]:
data

   s1  s2  s3  s4
0   4   1   9   2
1   0   0   6   5
2   4   1   2   9
3   2   3   7   1
4   7   7   8   0
5   7   1   5   5

In [4]:
data[0:2]

   s1  s2  s3  s4
0   4   1   9   2
1   0   0   6   5

In [5]:
data[["s1","s2"]]

   s1  s2
0   4   1
1   0   0
2   4   1
3   2   3
4   7   7
5   7   1

In [7]:
data.iloc[1:3,0:3] #satır ve sütunları verdiğim isme göre değilde gerçek indeksine göre çağırdım.

   s1  s2  s3
1   0   0   6
2   4   1   2

In [11]:
data.loc[1:2,"s1":"s3"] #gerçek indekse göre değilde benim tanımladığım şekildeki indekse göre çağırırsam loc komutu kullanılır.

   s1  s2  s3
1   0   0   6
2   4   1   2

In [12]:
data

   s1  s2  s3  s4
0   4   1   9   2
1   0   0   6   5
2   4   1   2   9
3   2   3   7   1
4   7   7   8   0
5   7   1   5   5

In [13]:
data.loc[2,"s4"]

9